# Pandas Review

Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

You can find it here: http://pandas.pydata.org/

And the documentation can be found here: http://pandas.pydata.org/pandas-docs/stable/

In this notebook we review some of its functionality.

In [43]:
import pandas as pd
import numpy as np

## Create random data

Create a dataframe with four features (columns), "A","B","C","D". The corresponding values could be (homoegeneous or heterogeneous) arrays, scalars, strings, missing values (NaN), etc.  
Indexing of the records (rows) is automatic (starting from 0).

In [44]:
df=pd.DataFrame({'A':np.array([1,7,2,-2],dtype='int32'),
                'B':1,
                'C':['pippo']*4,
                'D':np.array([0.5,'pluto',np.nan,np.nan])})
df

   A  B      C      D
0  1  1  pippo    0.5
1  7  1  pippo  pluto
2  2  1  pippo    nan
3 -2  1  pippo    nan

Now inspect the dataframe a little bit

In [45]:
df.head(3)

   A  B      C      D
0  1  1  pippo    0.5
1  7  1  pippo  pluto
2  2  1  pippo    nan

In [46]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [47]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [48]:
df.values

array([[1, 1, 'pippo', '0.5'],
       [7, 1, 'pippo', 'pluto'],
       [2, 1, 'pippo', 'nan'],
       [-2, 1, 'pippo', 'nan']], dtype=object)

Try some operations

In [49]:
df.T

       0      1      2      3
A      1      7      2     -2
B      1      1      1      1
C  pippo  pippo  pippo  pippo
D    0.5  pluto    nan    nan

In [50]:
df.sort_index(axis=0,ascending=False)

   A  B      C      D
3 -2  1  pippo    nan
2  2  1  pippo    nan
1  7  1  pippo  pluto
0  1  1  pippo    0.5

In [51]:
df.sort_values(by='A')

   A  B      C      D
3 -2  1  pippo    nan
0  1  1  pippo    0.5
2  2  1  pippo    nan
1  7  1  pippo  pluto

## Create and modify a  data frame
Now create a dataframe with with the dates (time series) as index and a corresponding 7x2 (7 records with 2 features) matrix of random numbers. The 2 features are "
Temperature" and "Humidity"

In [52]:
dates=pd.date_range('20170101', periods=7, freq='D')
dates

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07'],
              dtype='datetime64[ns]', freq='D')

In [53]:
a=pd.DatetimeIndex(['2017-01-01','2017-05-01'])
a

DatetimeIndex(['2017-01-01', '2017-05-01'], dtype='datetime64[ns]', freq=None)

In [54]:
df = pd.DataFrame(np.random.rand(7,2), index=dates, columns=['Temperature','Humidity'])
df

            Temperature  Humidity
2017-01-01     0.058719  0.421040
2017-01-02     0.171788  0.454795
2017-01-03     0.366513  0.094571
2017-01-04     0.487108  0.423526
2017-01-05     0.275599  0.585523
2017-01-06     0.856021  0.148496
2017-01-07     0.140384  0.580422

Add a column with power consumption in kWh

In [55]:
df['Power Consumption']=np.random.rand(7,1)+7.4
df

            Temperature  Humidity  Power Consumption
2017-01-01     0.058719  0.421040           7.989421
2017-01-02     0.171788  0.454795           7.914562
2017-01-03     0.366513  0.094571           8.047348
2017-01-04     0.487108  0.423526           8.246185
2017-01-05     0.275599  0.585523           7.652763
2017-01-06     0.856021  0.148496           8.216985
2017-01-07     0.140384  0.580422           7.925663

Modify the temperature to have a reasonable value for the season

In [56]:
df['Temperature']=np.random.randint(2,high=12, size=(7))
df

            Temperature  Humidity  Power Consumption
2017-01-01            6  0.421040           7.989421
2017-01-02            3  0.454795           7.914562
2017-01-03            8  0.094571           8.047348
2017-01-04            2  0.423526           8.246185
2017-01-05            8  0.585523           7.652763
2017-01-06            7  0.148496           8.216985
2017-01-07           11  0.580422           7.925663

Add a bogus feature and then remove it

In [57]:
df['bogus']=np.nan
df

            Temperature  Humidity  Power Consumption  bogus
2017-01-01            6  0.421040           7.989421    NaN
2017-01-02            3  0.454795           7.914562    NaN
2017-01-03            8  0.094571           8.047348    NaN
2017-01-04            2  0.423526           8.246185    NaN
2017-01-05            8  0.585523           7.652763    NaN
2017-01-06            7  0.148496           8.216985    NaN
2017-01-07           11  0.580422           7.925663    NaN

In [58]:
df=df.drop(['bogus'],axis=1)
df.head()

            Temperature  Humidity  Power Consumption
2017-01-01            6  0.421040           7.989421
2017-01-02            3  0.454795           7.914562
2017-01-03            8  0.094571           8.047348
2017-01-04            2  0.423526           8.246185
2017-01-05            8  0.585523           7.652763

## Indexing

Try to figure out what each of the following indexing method does.

If in trouble check here: http://pandas.pydata.org/pandas-docs/stable/indexing.html

Let's open a file with data about weight and height of a sample of men and women

## Getting 
Select a column (feature) by feature's name

In [59]:
df['Temperature'] # same as df.Temperature which is however sometimes impractical

2017-01-01     6
2017-01-02     3
2017-01-03     8
2017-01-04     2
2017-01-05     8
2017-01-06     7
2017-01-07    11
Freq: D, Name: Temperature, dtype: int64

In [79]:
df[['Temperature','Humidity']]

            Temperature  Humidity
2017-01-01            6  0.421040
2017-01-02            3  0.454795
2017-01-03            8  0.094571
2017-01-04            2  0.423526
2017-01-05            8  0.585523
2017-01-06            7  0.148496
2017-01-07           11  0.580422

Select rows by indeces

In [61]:
df[0:2]

            Temperature  Humidity  Power Consumption
2017-01-01            6  0.421040           7.989421
2017-01-02            3  0.454795           7.914562

Getting a cross section of the table by label

In [77]:
df.loc[dates[0]]
df.loc[:,['Humidity','Power Consumption']][0:1]

#df.loc['20170102',['Humidity','Temperature']]

            Humidity  Power Consumption
2017-01-01   0.42104           7.989421

# Selection by Position

In [63]:
df.iloc[3]
#df.ix[0]

Temperature          2.000000
Humidity             0.423526
Power Consumption    8.246185
Name: 2017-01-04 00:00:00, dtype: float64

In [64]:
df.iloc[2:4,1:3]

            Humidity  Power Consumption
2017-01-03  0.094571           8.047348
2017-01-04  0.423526           8.246185

Boolean selection

In [65]:
df[df['Temperature'] >= 7 ]

            Temperature  Humidity  Power Consumption
2017-01-03            8  0.094571           8.047348
2017-01-05            8  0.585523           7.652763
2017-01-06            7  0.148496           8.216985
2017-01-07           11  0.580422           7.925663

In [66]:
df[df > 5]

            Temperature  Humidity  Power Consumption
2017-01-01          6.0       NaN           7.989421
2017-01-02          NaN       NaN           7.914562
2017-01-03          8.0       NaN           8.047348
2017-01-04          NaN       NaN           8.246185
2017-01-05          8.0       NaN           7.652763
2017-01-06          7.0       NaN           8.216985
2017-01-07         11.0       NaN           7.925663

In [67]:
df2 = df.copy()
df2['Quality'] = ['nice day', 'nice day','soso day','bad day','bad day','soso day', 'wonderful day']
df2

            Temperature  Humidity  Power Consumption        Quality
2017-01-01            6  0.421040           7.989421       nice day
2017-01-02            3  0.454795           7.914562       nice day
2017-01-03            8  0.094571           8.047348       soso day
2017-01-04            2  0.423526           8.246185        bad day
2017-01-05            8  0.585523           7.652763        bad day
2017-01-06            7  0.148496           8.216985       soso day
2017-01-07           11  0.580422           7.925663  wonderful day

In [68]:
df2[df2['Quality'].isin(['wonderful day','nice day'])]

            Temperature  Humidity  Power Consumption        Quality
2017-01-01            6  0.421040           7.989421       nice day
2017-01-02            3  0.454795           7.914562       nice day
2017-01-07           11  0.580422           7.925663  wonderful day

## Setting

Setting a new column automatically aligns the data by the indexes

In [80]:
s1 = pd.Series(range(1,8), index=pd.date_range('20170102', periods=7))
print(s1)
df['Bogus'] = s1
df

2017-01-02    1
2017-01-03    2
2017-01-04    3
2017-01-05    4
2017-01-06    5
2017-01-07    6
2017-01-08    7
Freq: D, dtype: int64

            Temperature  Humidity  Power Consumption  Bogus
2017-01-01            6  0.421040           7.989421    NaN
2017-01-02            3  0.454795           7.914562    1.0
2017-01-03            8  0.094571           8.047348    2.0
2017-01-04            2  0.423526           8.246185    3.0
2017-01-05            8  0.585523           7.652763    4.0
2017-01-06            7  0.148496           8.216985    5.0
2017-01-07           11  0.580422           7.925663    6.0

In [81]:
df2.iloc[0,1] = 0
df2.loc[:,'Temperature'] = np.array([5] * len(df))
df2

            Temperature  Humidity  Power Consumption        Quality
2017-01-01            5  0.000000           7.989421       nice day
2017-01-02            5  0.454795           7.914562       nice day
2017-01-03            5  0.094571           8.047348       soso day
2017-01-04            5  0.423526           8.246185        bad day
2017-01-05            5  0.585523           7.652763        bad day
2017-01-06            5  0.148496           8.216985       soso day
2017-01-07            5  0.580422           7.925663  wonderful day

Example of fancy operation (column removal if records are not numbers)

In [82]:
for column in df2.columns:
    if not np.issubdtype(df2[column].dtype, np.number):
        df2.drop(column, axis=1, inplace=True)
df2

            Temperature  Humidity  Power Consumption
2017-01-01            5  0.000000           7.989421
2017-01-02            5  0.454795           7.914562
2017-01-03            5  0.094571           8.047348
2017-01-04            5  0.423526           8.246185
2017-01-05            5  0.585523           7.652763
2017-01-06            5  0.148496           8.216985
2017-01-07            5  0.580422           7.925663

Some other global operations

In [ ]:
#-df
#df*5
df2[df2['Power Consumption']>8]=-df2
df2

Theres much more that Pandas can do for you. Make sure to check the documentation: http://pandas.pydata.org/pandas-docs/stable/

## Exercises:

now try excercise with the following dataset:

In [ ]:
df = pd.read_csv("../data/titanic-train.csv")

- select passengers that survived
- select passengers that embarked in port S
- select male passengers
- select passengers who paid less than 40.000 and were in third class
- locate the name of passegner Id 674
- calculate the average age of passengers using the function mean()
- count the number of survived and the number of dead passengers
- count the number of males and females
- count the number of survived and dead per each gender
- calculate average price paid by survived and dead people